<template>
	<view class="page">
		<view class="content">
			App服务协议<br>
			
			1. 介绍<br>
			
			1.1 本协议规定了您（以下简称“用户”）使用我们提供的App（以下简称“App”）的条件和条款。<br>
			
			1.2 使用本App即表示您同意遵守本协议的所有条款和条件。如果您不同意这些条款和条件，请不要使用本App。<br>
			
			2. 服务<br>
			
			2.1 我们提供本App，旨在提供特定的功能和服务。<br>
			
			2.2 我们保留随时修改或中断服务的权利，恕不另行通知。<br>
			
			3. 用户的责任<br>
			
			3.1 您同意以合法和适当的方式使用本App，并遵守所有适用的法律和法规。<br>
			
			3.2 您同意不会利用本App进行非法活动、侵犯他人权利或违反本协议规定的行为。<br>
			
			4. 用户账户<br>
			
			4.1 您可能需要创建一个账户才能使用本App的特定功能。您须对您的账户信息保密，并对您的账户和密码负全部责任。<br>
			
			4.2 如果您发现您的账户信息被未经授权使用或存在安全问题，请立即通知我们。<br>
			
			5. 信息收集与隐私<br>
			
			5.1 我们可能会收集和使用您的个人信息，用于提供服务和改善用户体验。我们将严格遵守隐私政策，保护您的个人信息安全。<br>
			
			5.2 请阅读我们的隐私政策，了解我们如何收集、使用和分享您的信息。<br>
			
			6. 知识产权<br>
			
			6.1 本App及其相关内容（包括但不限于软件、文字、图像、标识等）的知识产权归我们或我们的许可方所有。<br>
			
			6.2 您不得未经授权复制、修改、传播、出售或利用本App的任何部分。<br>
			
			7. 免责声明<br>
			
			7.1 本App按“现状”提供，不对功能的持续性、准确性、完整性或适用性作出任何保证。<br>
			
			7.2 在适用法律允许的最大范围内，我们不对因使用本App而产生的任何直接或间接损失负责。<br>
			
			8. 终止<br>
			
			8.1 我们有权在任何时候终止或暂停您对本App的访问，无需提前通知。<br>
			
			9. 法律适用<br>
			
			9.1 本协议受所在司法管辖区的法律管辖。<br>
			
			10. 其他条款<br>
			
			10.1 如果本协议的任何部分被认定为无效或不可执行，其余部分仍应有效并具有约束力。<br>
			
			10.2 本协议构成您和我们之间关于本App使用的完整协议，取代所有先前的沟通和协议。<br>
			
		</view>

	</view>
</template>

<script>
	export default {
		data() {
			return {
				
			}
		},
		methods: {
			back(){
				uni.redirectTo({
					url:'/pages/login/wxLogin'
				})
			}
		}
	}
</script>

<style>
	.page{
		padding: 2%;
		font-size: 14px;
		color: gray;
	}
	
	.icon {
		position: fixed;
		top: 6%;
		left: 4%;
		color: #777;
		z-index: 10;
	}
	

</style>
